# FaceSplitter Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSplitter Class
Members See Also
---
Represents an element that splits a face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class FaceSplitter : Element
```

Visual Basic
---
```text
Public Class FaceSplitter _
	Inherits Element
```

Visual C++
---
```text
public ref class FaceSplitter : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FaceSplitter
# See Also
FaceSplitter Members
Autodesk.Revit.DB Namespace